[www.TML.cn]
TML=MVFFT-UTGDE0-B0JUG-VDBGEL-ADTTB
SystemType=0

;本服务器的所在网格编号：
TML_Grid=1

;本服务器外部IP
TML_IP=127.0.0.1

;本服务器端口
TML_Port=10000

;启动时是否隐藏窗口
HideWin=0

;;;;;;;;;;;延后启动，使用于Oracle和DB2数据库,单位秒
TMLtime=0

;;;;;;;;;;;;;;;自动升级设置;;;;;;;;;;;;;;;
;自动升级版本
Ver=4001
;新版本下载地址,不带Http://开头
DownLoad=127.0.0.1/game/update.exe

;;;;;;;;;;;;;;;提成核算选项;;;;;;;;;;;;;;;
;TML_EveryDay0Count每天凌晨0点自动核算,1为是，0为否
TML_ED0C=1

;TML_TexOrWin核算方式，1为按收税核算，0为按赢的核算
TML_TOW=1

;取最大ID，MS SQL换为SELECT Max(UserID) as maxUserID FROM USERS(NOLOCK)
TML_SQL_GetMaxID=SELECT Max(UserID) as maxUserID FROM USERS

;用户注册语句，如果UserID是自增的，要换掉。
TML_SQL_RegUser=INSERT into USERS (UserID,Name,ScrName,Pass,WebPass,LogoID,Boy,RegIP,RegTM) VALUES (%d,'%s','%s','%s','%s',%d,%d,'%s','%s')

;用户注册更新
TML_SQL_RegUp=update USERS set SN='%s%s'%s,LastLoginTM=RegTM,OptionTime=RegTM,AllLoginTimes=1,LastLoginIP=RegIP where UserID=%d

;用户登陆验证
TML_SQL_Login=SELECT * FROM USERS WHERE USERS.Name='%s'
;TML_SQL_Login=SELECT * FROM USERS, USER_1 WHERE USERS.UserID=USER_1.UserID AND USERS.Name='%s'

;登陆后执行的SQL
TML_SQL_LoginUP=UPDATE USERS SET AllLoginTimes=AllLoginTimes+1, LastLoginTM='%s',OptionTime='%s', LastLoginIP='%s',SN='%s',IEdata='' WHERE (UserID=%ld)

;组件实例和在线人数
TML_RoomList=SELECT ServerPort,On_Line,Base_Line FROM TML_Server

;组件类型列表 MS SQL换为SELECT * FROM ComType(NOLOCK) WHERE Enable=1 ORDER BY Sort
TML_ComType=SELECT * FROM ComType  WHERE Enable=1 ORDER BY Sort

;读组件名称 MS SQL换为SELECT * FROM ComList(NOLOCK) WHERE Enable=1 ORDER BY Sort
TML_ComName=SELECT * FROM ComList WHERE Enable=1 ORDER BY Sort

;读网格实例信息
TML_GridList=SELECT TypeID,ComList.ComID,ServerPort,On_Line,Base_Line,TeamUser,Ver,UnitCount,ip,SvrName,SvrRule FROM ComList INNER JOIN (TML_Server INNER JOIN Grid ON Grid.ID=TML_Server.Grid) ON ComList.ComID=TML_Server.ComID
TML_GridListWhere=WHERE TML_Server.Enable=1 ORDER BY TML_Server.Sort
;只显示服务器列表TML_GridListWhere=WHERE TML_Server.Enable=1 AND Grid.ID=%d ORDER BY TML_Server.Sort

;下面语句用于非网格模态 增加过滤功能则可增加 UpdateTime>=DATEADD(MI,-3,GETDATE())
;SELECT TypeID,ComList.ComID,ServerPort,On_Line,TeamUser,Ver,UnitCount,grid,SvrName FROM ComList INNER JOIN TML_Server ON ComList.ComID=TML_Server.ComID WHERE ComList.Enable=1  AND TML_Server.Enable=1 ORDER BY TML_Server.Sort

;效验 IP 地址 MS SQL换为SELECT * FROM IPRule_1(NOLOCK) WHERE AccessIPChar='%s' AND OverTime>=GETDATE()
TML_SQL_IP=SELECT * FROM IPRule_1 WHERE AccessIPChar='%s' AND OverTime>=GETDATE()

;禁止注册的用户名，用|分割，包含关系
LimitName=NYS|TML|系统|管理|外管|内管|金币|消息|中奖|信息|工作人员|宣传员|阿曼尼

;数据库中限制的字符 MS SQL换为SELECT * FROM SystemInfo(NOLOCK) WHERE VisitName='LimitedString'
TML_SQL_Limite=SELECT * FROM SystemInfo WHERE VisitName='LimitedString' 

;读泡分数据（免费用）
TML_SQL_PaoFen=SELECT PointAuto FROM %s  WHERE UserID=%ld

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;网格处理器列表
TML_GridCPUList=SELECT ID,NAME,IP FROM Grid order by ID

;更新网格处理器列表
TML_GridCPUup=UPDATE Grid SET IP='%s' where ID=%d

;增加网格处理器列表
TML_GridCPUadd=insert into Grid(ID,NAME,IP) values(%s,'%s','%s')

;修改网格处理器列表
TML_GridCPUmodify=UPDATE Grid SET Name='%s',IP='%s' where ID=%s

;删除网格处理器列表
TML_GridCPUdel=Delete * from Grid where ID=%s

;要启动的网格服务， 它使每台网格服务器只启动相应的服务。
TML_GridSvrList=SELECT * FROM TML_Server,ComList WHERE TML_Server.ComID=ComList.ComID AND TML_Server.Grid=%d AND TML_Server.Enable=1 AND ComList.Enable=1 order by TML_Server.ComID

;网格中间件列表,MS SQL改为SELECT * FROM ComList(NOLOCK)
TML_ComList=SELECT * FROM ComList where Enable=1

;;;;;;;;;;;;;;;数据表设置;;;;;;;;;;;;;;;
;用户表
TML_USERS=USERS

;用户表最后登陆IP
TML_UserLastLoginIP=LastLoginIP

;用户表中用户ID对应的[字段]
TML_UserID=UserID

;用户表中用户名对应的[字段]
TML_UserName=Name

;用户表中显示名(呢称)对应的[字段]
TML_ScrName=ScrName

;用户表中用户密码对应的[字段]
TML_UserPass=Pass

;用户表中用户头像ID对应的[字段]
TML_UserLogoID=LogoID

;用户表中用户性别对应的[字段]
TML_UserSex=Boy

;用户表用户门派对应的[字段]
TML_UserClassName=ClassName

;用户表用户会员级别对应的[字段]
TML_UserMember=Member 

;用户表用户充值货币（非游戏币）对应的[字段]
TML_UsrMoney=Money

;用户禁用字段
TML_UserDisable=Disable

;各组件表权限对应的[字段]
TML_GamePower=GamePower

;各游戏房间表管理权限对应的[字段]
TML_MasterPower=MasterPower

;各游戏房间表管理员对应的[字段]
TML_GameMaster=GameMaster

;各游戏房间表赢次数对应的[字段]
TML_Win=Win

;各游戏房间表输次数对应的[字段]
TML_Lost=Lost

;各游戏房间表逃跑次数对应的[字段]
TML_Cut=Cut

;各游戏房间表和局次数对应的[字段]
TML_Mid=Mid

;各游戏房间表（分数）对应的[字段]
TML_Point=Point

;各游戏房间表金币对应的[字段]
TML_GamePoint=GamePoint

;游戏魅力对应[字段]
TML_MeiLi=MeiLi

;游戏魅力对应[字段]
TML_MeiLiHe=MeiLiHe
;记录在线时间的字段
TML_OnLineTime=OnLineTimeCount

;记录游戏时间的字段
TML_PlayTime=PlayTimeCount

TML_FSZID=SFZID

;经验值
TML_Experience=Experience

;推荐人ID
TML_RecommentUserID=RecommentUserID

;个性签名
TML_Signature=Signature

;从数据库中读出机器人，加入游戏,机器人会员级别是1，普通玩家是0，会员是1以上
TML_SQL_AI=SELECT * FROM USERS WHERE Member=255

;用户信息检查SQL MS SQL改为SELECT * FROM USERS(NOLOCK) WHERE UserID='%ld'
TML_SQL_ChkUser=SELECT * FROM USERS WHERE UserID=%ld

;读用户表，MS SQL改为SELECT * FROM %s(NOLOCK) WHERE UserID=%ld 如果下句中加入Point>=0，那么如果有负分就会新加一条新记录
TML_SQL_Room=SELECT * FROM %s WHERE UserID=%ld

;修改用户分数
TML_SQL_Update=UPDATE %s SET Point=Point+%I64d,GamePoint=GamePoint+%I64d,Win=Win+%d,Lost=Lost+%ld,Mid=Mid+%ld,Cut=Cut+%ld,PlayTimeCount=PlayTimeCount+%ld,OnLineTimeCount=OnLineTimeCount+%ld WHERE UserID=%ld

;修改用户经验
TML_SQL_UpEXP=UPDATE USERS SET Experience=Experience+%ld WHERE UserID=%ld

;修改用户财富
TML_SQL_UpMoney=UPDATE USERS SET [Money]=[Money]+%I64d Where UserID=%ld

;修改用户魅力
TML_SQL_UpMeiLi=update USERS set MeiLi=MeiLi+%d,MeiLiHe=MeiLiHe+%d where UserID=%d

;查询记分的缓冲数据，MS SQL改为SELECT * FROM BufferPoint(NOLOCK) WHERE (UserID=%ld) AND (ServerPort=%ld) AND (ComID=%ld)
TML_SQL_Buffer=SELECT * FROM BufferPoint WHERE (UserID=%ld) AND (ServerPort=%ld) AND (ComID=%ld)

;查询房间记分的缓冲数据，MS SQL改为SELECT * FROM BufferPoint(NOLOCK) WHERE (ServerPort=%ld) AND (ComID=%ld)
TML_SQL_Buffer2=SELECT * FROM BufferPoint WHERE (ServerPort=%ld) AND (ComID=%ld)

;记录记分的缓冲数据
TML_SQL_InBuffer=INSERT INTO BufferPoint (UserID,ServerPort,ComID) VALUES (%ld,%ld,%ld)

;更新记分的缓冲数据
TML_SQL_UpBuffer=UPDATE BufferPoint SET Point=Point+%I64d,GamePoint=GamePoint+%I64d,Win=Win+%d,Lost=Lost+%d,Mid=Mid+%d,Cut=Cut+%d,PlayTimeCount=PlayTimeCount+%ld,OnLineTimeCount=OnLineTimeCount+%ld WHERE UserID=%ld AND ServerPort=%ld AND ComID=%ld

;删除记分的缓冲数据
TML_SQL_DelBuffer=DELETE BufferPoint WHERE UserID=%ld AND ServerPort=%ld AND ComID=%ld

;更新游戏表
TML_SQL_UpGame=UPDATE %s SET ServerPort=%ld,ComID=%ld WHERE UserID=%ld

;插入游戏表
TML_SQL_InGame=INSERT into %s (UserID,ServerPort,ComID,Point,Win,Lost,Mid,Cut,PlayTimeCount,OnLineTimeCount) VALUES (%ld,%ld,%ld,%I64d,%ld,%ld,%ld,%ld,%ld,%ld)

;记录经验缓冲数据
TML_SQL_InBufEXP=INSERT INTO BufferExperience (UserID) VALUES (%ld)

;更新记分的缓冲数据
;TML_SQL_UpBufEXP=UPDATE BufferExperience SET Experience=Experience+%ld WHERE UserID=%ld
TML_SQL_UpBufEXP=UPDATE USERS SET MONEY=MONEY+%ld/60*5000 WHERE UserID=%ld
;记录房间日志
TML_SQL_Log=INSERT INTO TML_log (ServerPort,UserID,ScrPoint,ChangePoint,ResultPoint,AutoPoint,ChangeWin,ChangeLost,ChangeMid,ChangeCut,OnLineTime) VALUES (%ld,%ld,%I64d,%I64d,%I64d,%d,%ld,%ld,%ld,%ld,%ld)

;用户登陆进房间，插入锁定表
TML_SQL_RegLogin=INSERT INTO %s (UserID,ServerPort,AccessIP,SvrName) VALUES (%ld,%ld,'%s','%s')

;更新在线人数
TML_SQL_UpRoom=UPDATE TML_Server SET On_Line=%ld,UpdateTime=GETDATE()WHERE ComID=%ld AND ServerPort=%ld

;效验IP地址 MS SQL改为SELECT * FROM IPRule_1(NOLOCK) WHERE AccessIPChar='%s' AND OverTime>=GETDATE()
TML_SQL_IPRule=SELECT * FROM IPRule_1 WHERE AccessIPChar='%s' AND OverTime>=GETDATE()
;查询比赛信息 MS SQL改为SELECT * FROM MatchUserInfo(NOLOCK) WHERE (DeskIndex BETWEEN 0 AND %ld) AND (DeskStation BETWEEN 0 AND %ld) AND (MatchInfoID=%ld) AND (EnableUser=1) ORDER BY DeskIndex,DeskStation
TML_SQL_Match=SELECT * FROM MatchUserInfo WHERE (DeskIndex BETWEEN 0 AND %ld) AND (DeskStation BETWEEN 0 AND %ld) AND (MatchInfoID=%ld) AND (EnableUser=1) ORDER BY DeskIndex,DeskStation

;房间登陆信息
RoomLoginMsg=欢迎进入UU游戏！

;游戏登陆信息
GameLoginMsg=欢迎进入UU游戏！

;获取泡分数目
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;将用户充值币兑换成游戏币,以下两个语句相关联。

;校验用户剩余充值币是否足够
TML_SQL_EX0=Select Money From [USERS] Where [UserID]=%d And [Money]>=%I64d

;扣除用户充值币的SQL语句
TML_SQL_EX1=Update [USERS] Set [Money]=[Money]+%I64d Where [UserID]=%d

;增加用户游戏币的SQL语句，注意这张表可能不在一个数据库中，是用户登陆的房间对应的表，用%s代替，由程序控制 
TML_SQL_EX2=Update %s Set Point=Point+%I64d Where UserID=%d and ServerPort=%d

;兑换比率，初始用户使用。可更改，但必须是正整数
TML_SQL_EXbei=10000

;充值
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;校验用户余额
;TML_SQL_CZ0=select money from USERS where Name='%s'
TML_SQL_CZ0=select money from USERS where UserID=%s

;校验充值卡余额
TML_SQL_CZ1=select jine from card where num='%s' and pwd='%s' and pay=0

;充值
TML_SQL_CZ2=update Users set [money]=[money]+%I64d where Name='%s'

;更新充值卡
TML_SQL_CZ3=update card set player='%s',ip='客户端充值',tm=now,pay=1 where num='%s'
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;道具
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;查询道具
TML_SQL_TOOL1=select ToolCount,ToolType from TMLcnTool where [UserID]=%d

;增加道具
TML_SQL_TOOL2=insert into TMLcnTool(UserID,ToolType,ToolCount) values(%d,%d,%d)

;修改道具
TML_SQL_TOOL3=Update TMLcnTool set ToolCount=ToolCount+%d where [UserID]=%d and [ToolType]=%d

;修改道具
TML_SQL_Card=Update TMLcnTool set ToolCount=%d where [UserID]=%d and [ToolType]=%d
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;修改会员
TML_SQL_Up_HuiYUAN1=update USERS set hy=now where UserID=%d and hy<now
TML_SQL_Up_HuiYUAN2=update USERS set Member=%d,hy=hy+%d where UserID=%d

;查询二级密码
TML_SQL_2pass=select [webpass] from USERS where UserID=%d

;查询存款
TML_SQL_2MONEY=select [Bank],[webpass],[Money] from USERS where UserID=%d

;修改银行
TML_SQL_UpYinhang=UPDATE USERS SET [BankPoint]=[BankPoint]+%I64d,bank=bank+%d,[Money]=[Money]+%I64d Where UserID=%d
;转账
;TML_SQL_UpYinhangZZ=UPDATE USERS SET [BankPoint]=[BankPoint]+%d,bank=bank+%d,[Money]=[Money]+%d Where Name='%s'
TML_SQL_UpYinhangZZ=UPDATE USERS SET [BankPoint]=[BankPoint]+%I64d,bank=bank+%d,[Money]=[Money]+%I64d Where UserID=%s
;更改银行密码
TML_SQL_UpBankPass=UPDATE USERS SET [webpass]='%s' Where UserID=%d
;锁机
TML_SQL_LOCK=update USERS set LOCK='%s' where UserID=%d
;更改用户权限(游戏表)
TML_SQl_POWER=update %s set GamePower=%d where UserID=%d
;查找
TML_SQL_FINDUSER=SELECT * from (select * from Lock_1 Union all select * from Lock_2 Union all select * from Lock_3 Union all select * from Lock_4 Union all select * from Lock_5 )a where Userid=%d


;道具价格
TMLPropPrice=(200000,150000,100000,200000,250000,200000,100000,600000,50000,32000,300000,1200000,4000000)
;礼物价格
TMLPresentPrice=(40000,50000,60000,70000,80000,90000,100000,200000,300000)
;鲜花价格
TMLflowerPrice=(1000,2000,5000,10000,20000,50000,2000,5000,10000,10000)
;礼物对应增加的魅力值
TMLMeiLiCount=(4,5,6,7,8,9,10,20,30,100,200,300)
;鲜花对应增加的魅力值
TMLflowerMeiLiCount=(1,2,5,10,20,50,30,-2,-5,-10)

;机器人未同意开始,自动离开桌子的几率,在0~100之间,默认为25,不离开请设为0
TMLAISittingLeftOdd=25
;机器人同意开始之后,自动离开桌子的几率,在0~100之间,默认为30,不离开请设为0
TMLAIAgreeLeftOdd=30

;花数兑换值
TMLMoneyCount=7000
;购买道具限制
TMLpoint=0
;会员是否打折
TMLMember=8

;是否增加魅力值 0为是
TMLPt=0
TMLPresent0= 【赠送】：【%s】为【%s】送上掌声%d个,【%s】增加魅力值%d点。
TMLPresent1= 【赠送】：【%s】为【%s】送上香吻%d个,【%s】增加魅力值%d点。
TMLPresent2= 【赠送】：【%s】为【%s】送上汽车%d个,【%s】增加魅力值%d点。
TMLPresent3= 【赠送】：【%s】为【%s】送上房子%d个,【%s】增加魅力值%d点。
TMLPresent4= 【赠送】：【%s】为【%s】送上财神%d个,【%s】增加魅力值%d点。
TMLPresent5= 【赠送】：【%s】为【%s】送上佛祖%d个,【%s】增加魅力值%d点。

;每局送赢家的金币数
TMLGiveMoneyForWinner=10



[AI_SET]
;机器人存钱取钱////////////////////////////////////////////////////////////
;当机器人的游戏币大于此数目时,机器人会将多余此数的游戏币存入银行
TML_Bank_MaxPoint=1200000
;当机器人的游戏币小于此数目时,机器人会从银行取出 min(AddPoint, 银行中的游戏币数) 游戏币
TML_Bank_MinPoint=50000
;机器人一次取银行操作最多能取出的游戏币数
TML_Bank_AddPoint=500000
